import { Music } from "@/types/music"

export const music: Music[] = [
    {
        id: 1,
        name: "HYBS",
        songtype: "pop",
        member: `1.เจมส์- อลิน วี
        , 2.กานต์- กษิดิ์เดช หงส์ลดารมภ์`,
        image: "/images/bands/1.jpg",
        history: `  เริ่มต้น สองเพื่อนสนิทที่ไม่ได้เจอกัน 8ปี กลับมารวมตัวทำเพลงเล่นๆช่วงโควิด-19จนได้เดบิวต์ในปี 2564(2021)และหลังจากออกซิงเกิลแรก "Ride" และเพลง "Dancing With My Phone" ก็ได้แจ้งเกิดทันที`,
    },
    {
        id: 2,
        name: "Purpeech",
        songtype: "อินดี้ป๊อป",
        member: `เล็ก- ศราวุฒิ สุยะเขต/
        ยีนส์- ภูริช สมชื่อ/
        เซ็นต์- สิทธิโชค ตาสา/
        คอมพ์- ทรรศนะ เพ็ญจันทร์/
        เจมส์- จักรพรรณ ธนาศุภณัฏฐ์`,
        image: "/images/bands/p.jpg",
        history: `สมาชิกในวงเคยเป็นนักร้องและนักดนตรีกลางคืนในเชียงใหม่ อยู่มาวันหนึ่ง เซ็นต์ หนึ่งในสมาชิกแต่งเพลงส่งเข้าประกวดในเชียงใหม่และได้รางวัลที่ 1 จึงนำมาสู่การทำเพลงแรกของวง สมาชิกทั้งหมดตัดสินใจลาออกจากงานประจำ เพื่อมาทุ่มเทให้กับการทำวงดนตรีอย่างจริงจัง`,
    },
     {
        id: 3,
        name: "Linkin Park",
        songtype:"นูเมทัล(Nu Metal) ที่ผสมผสานร็อก ฮิปฮอป และอิเล็กทรอนิกส์เข้าด้วยกันอย่างลงตัว",
        member:`ไมค์ ชิโนดะ/
        แบรด เดลสัน/
        ร็อบ บูร์ดอน`,
        image:"/images/bands/lp.jpg",
        history:`ปี 1996: เริ่มต้นวงในชื่อ Xero ก่อนจะเปลี่ยนเป็น Hybrid Theory
        ปี 1999: ได้ เชสเตอร์ เบนนิงตัน มาเป็นนักร้องนำ และเปลี่ยนชื่อวงเป็น Linkin Park
        ปี 2000: ปล่อยอัลบั้มแรก Hybrid Theory ประสบความสำเร็จถล่มทลายทั่วโลกด้วยเพลงฮิตอย่าง In the End
        ปี 2003: ตอกย้ำความยิ่งใหญ่ด้วยอัลบั้ม Meteora ที่มีเพลงระดับตำนานอย่าง Numb
        ปี 2017: เชสเตอร์ เบนนิงตัน เสียชีวิต วงประกาศพักงานอย่างไม่มีกำหนด
        ปี 2024: กลับมารวมตัวอีกครั้ง พร้อมเปิดตัว เอมิลี่ อาร์มสตรอง เป็นนักร้องนำหญิงคนใหม่ และปล่อยอัลบั้ม From Zero`

     }

]
